#  3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

n=input('Введите строку символов: ')
m=input('Введите искомый символ: ')

print(n.count(m))






